Repository: 84000/data-translation-memory
Catalog: toh145-v4.tmx
Source language: bo
Languages: en

source: ཆོས་ཐམས་ཅད་ལ་མི་རྟག་པ་ཉིད་དུ་རྟོགས་པར་བྱེད་པ་དང་། ཆོས་ཐམས་ཅད་ལ་སྡུག་བསྔལ་བ་ཉིད་དང་། བདག་མེད་པ་ཉིད་དང་། སྟོང་པ་ཉིད་དང་། གཡོ་བ་མེད་པ་ཉིད་དང་། དབུགས་འབྱིན་པ་མེད་པ་ཉིད་དང་། གནས་མེད་པ་ཉིད་དང་། རྣམ་པར་རྟོག་པ་མེད་པ་ཉིད་དང་། རྩོལ་བ་མེད་པ་ཉིད་དང་། མངོན་བར་འདུ་བྱེད་པ་མེད་པ་ཉིད་དུ་རྟོགས་པར་བྱེད་དེ།
en: (1) understanding all phenomena to be impermanent, (2) understanding all phenomena to be suffering, (3) to be without a self, (4) to be empty, (5) to be immovable, (6) to be without increase, (7) to be without any situation, (8) to be nonconceptual, (9) to be effortless, and (10) not to be produced.

source: ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བར་གྱུར་བའི་ཕྱིར་སྦྱོར་བར་མི་བྱེད། མི་སྦྱོར་བར་ཡང་མི་བྱེད་དེ།
en: These bodhisattvas should understand those ten aspects, but since they are followers of the Dharma, they practice neither application nor non-application.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་རྣལ་འབྱོར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའོ།།
en: O sons of the victors, such are bodhisattvas who engage in yogic practice.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་རྣལ་འབྱོར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སེམས་ཅན་གྱི་ཁམས་བརྟག་པ་ལ་སྦྱར་བར་བྱའོ།།
en: “O sons of the victors, bodhisattvas who engage in yogic practice should apply themselves to investigating the constitution of sentient beings.

source: ཆོས་ཀྱི་དབྱིངས་བརྟག་པ་ལ་སྦྱར་བར་བྱའོ།
en: They should apply themselves to investigating the dharmadhātu.

source: །འཇིག་རྟེན་གྱི་ཁམས་བརྟག་པ་ལ་སྦྱར་བར་བྱའོ།།
en: They should apply themselves to investigating the world realm.

source: སའི་ཁམས་བརྟག་པ་ལ་སྦྱར་བར་བྱའོ།།
en: They should apply themselves to investigating the element of earth.

source: ཆུའི་ཁམས་དང་མེའི་ཁམས་དང་རླུང་གི་ཁམས་དང་ནམ་མཁའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་གཟུགས་མེད་པའི་ཁམས་བརྟག་པ་ལ་སྦྱར་བར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: They should apply themselves to investigating the elements of water, fire, air, and space, and the form and formless realms. Why is that?

source: འདི་ལྟར་དེ་ནི་ཤས་ཆེར་ཆོས་རྣམས་ལ་སྣང་བ་འཇུག་ཅིང་གོང་དུ་གནས་གང་དག་ཐོས་པའི་གནས་དེ་དག་ལ་ཡང་བདག་ཉིད་སྦྱོར་གྱི་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པ་ཐོབ་པའི་ཕྱིར་ཏེ།
en: It is because for the most part they have direct insight that operates regarding all phenomena, and those subjects of learning acquired previously are mastered with their own application and without recourse to dependence on others.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་རྣལ་འབྱོར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པའོ།།
en: O sons of the victors, such is the category of bodhisattvas who engage in yogic practice.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་སྐྱེ་བར་སྐྱེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པ་གང་ཞེ་ན།
en: (4) “O sons of the victors, what is the category of bodhisattvas who have taken rebirth?

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ལ་སྐྱེ་བར་སྐྱེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཡོངས་སུ་སྤྱོད་པ་བྱེད་པ་བཅུས་གསུང་རབ་འཕགས་པར་སྐྱེས་པ་ཡིན་ཏེ།
en: O sons of the victors, bodhisattvas who have taken rebirth are born as exalted in sacred scripture thanks to ten purifiers.

source: ཆོས་ཉིད་ལས་ཕྱིར་མི་ཟློགས་པ་དང་། སངས་རྒྱས་ལ་མི་ཕྱེད་པའི་དད་པ་མཐར་ཐུག་པར་འགྱུར་བ་ཡོངས་སུ་གྲུབ་པ་དང་། ཆོས་ངེས་པར་སེམས་པ་དང་། སེམས་ཅན་ལ་རྣམ་པར་དཔྱོད་པ་དང་། ཞིང་ལ་རྣམ་པར་དཔྱོད་པ་དང་། འཇིག་རྟེན་ལ་རྣམ་པར་དཔྱོད་པ་དང་། ལས་ལ་རྣམ་པར་དཔྱོད་པ་དང་། རྣམ་པར་སྨིན་པ་ལ་རྣམ་པར་དཔྱོད་པ་དང་། འཁོར་བ་ལ་རྣམ་པར་དཔྱོད་པ་དང་། མྱ་ངན་ལས་འདས་པ་ལ་རྣམ་པར་དཔྱོད་པ་སྟེ།
en: (1) Not turning back from ultimate reality, (2) accomplishing what will become the highest undivided faith in the Buddha, (3) contemplating the Dharma, (4) investigating sentient beings, (5) investigating the pure lands, (6) investigating the world, (7) investigating deeds, (8) investigating karmic consequences, (9) investigating saṃsāra, and (10) investigating nirvāṇa.

source: ཡོངས་སུ་སྦྱོང་བ་བྱེད་པ་བཅུ་པོ་དེ་དག་གིས་གསུང་རབ་འཕགས་པར་སྐྱེས་པ་ཡིན་ཏེ།
en: Bodhisattvas will take rebirth as exalted in sacred scripture thanks to those ten purifiers.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་སྐྱེ་བར་སྐྱེས་པའི་བྱང་ཆུབ་སེམས་དཔའོ།།
en: O sons of the victors, such is the category of bodhisattvas who have taken rebirth.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་སྐྱེ་བར་སྐྱེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་འདས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མཉམ་པ་ཉིད་རྣམ་པར་དཔྱད་པ་ལ་སྦྱར་བར་བྱའོ། །མ་བྱོན་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མཉམ་པ་ཉིད་རྣམ་པར་དཔྱད་པ་ལ་སྦྱར་བར་བྱའོ། །ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་ཀྱི་ཆོས་མཉམ་པ་ཉིད་རྣམ་པར་དཔྱད་པ་ལ་སྦྱར་བར་བྱའོ།།
en: “O sons of the victors, these bodhisattvas who have taken rebirth should apply themselves to investigating the sameness of the dharmas of all past buddhas, apply themselves to investigating the sameness of the dharmas of all future buddhas, and apply themselves to investigating the sameness of the dharmas of all present buddhas.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་མཉམ་པ་ཉིད་རྣམ་པར་དཔྱད་པ་ལ་སྦྱར་བར་བྱའོ།
en: They should apply themselves to investigating the sameness of the dharmas of all buddhas.

source: །འདས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་ཡང་དག་པར་འགྲུབ་པ་རྣམ་པར་དཔྱད་པ་ལ་སྦྱར་བར་བྱའོ། །
en: “They should apply themselves to the investigation that correctly establishes the dharmas of past buddhas,

source: མ་བྱོན་པའི་སངས་རྒྱས་ཀྱི་ཆོས་ཡང་དག་པར་འགྲུབ་པ་རྣམ་པར་དཔྱད་པ་ལ་སྦྱར་བར་བྱའོ། །
en: apply themselves to the investigation that correctly establishes the dharmas of future buddhas,

source: ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་ཀྱི་ཆོས་ཡང་དག་པར་འགྲུབ་པ་རྣམ་པར་དཔྱད་པ་ལ་སྦྱར་བར་བྱའོ།
en: and apply themselves to the investigation that correctly establishes the dharmas of present buddhas.

source: །སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཡང་དག་པར་འགྲུབ་པ་རྣམ་པར་དཔྱད་པ་ལ་སྦྱར་བར་བྱའོ།།
en: They should apply themselves to the investigation that correctly establishes the dharmas of all buddhas.

source: འདས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་འགྲུབ་པ་མཉམ་པ་ཉིད་རྣམ་པར་དཔྱད་པ་ལ་སྦྱར་བར་བྱའོ། །
en: “They should apply themselves to investigating the sameness of the perfection of the qualities of past buddhas,

source: མ་བྱོན་པའི་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་འགྲུབ་པ་མཉམ་པ་ཉིད་རྣམ་པར་དཔྱད་པ་ལ་སྦྱར་བར་བྱའོ། །
en: apply themselves to investigating the sameness of the perfection of the qualities of future buddhas,

source: ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་འགྲུབ་པ་མཉམ་པ་ཉིད་རྣམ་པར་དཔྱད་པ་ལ་སྦྱར་བར་བྱའོ།།
en: and apply themselves to investigating the sameness of the perfection of the dharmas of present buddhas.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཡོངས་སུ་འགྲུབ་པ་མཉམ་པ་ཉིད་རྣམ་པར་དཔྱད་པ་ལ་སྦྱར་བར་བྱའོ།།
en: They should apply themselves to investigating the sameness of the perfection of the dharmas of all buddhas.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Why is that?

source: འདི་ལྟར་དེ་ནི་ཤས་ཆེར་དུས་གསུམ་མཉམ་པ་ཉིད་དུ་རྟོགས་པར་བྱེད་ཅིང་། གོང་དུ་གནས་གང་དག་ཐོས་པའི་གནས་དེ་དག་ལ་ཡང་བདག་ཉིད་སྦྱོར་གྱི་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པ་ཐོབ་པའི་ཕྱིར་ཏེ།
en: It is because for the most part they understand the sameness of the three times, and those subjects of learning acquired previously are mastered with their own application and without recourse to dependence on others.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་སྐྱེ་བར་སྐྱེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པའོ།།
en: O sons of the victors, such is the category of bodhisattvas who have taken rebirth. (5)

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་ལ་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པ་གང་ཞེ་ན།
en: “O sons of the victors, what is the category of bodhisattvas who have perfected application?

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ལ་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དགེ་བའི་ལས་གང་ཅི་རྩོམ་ཡང་དེ་དག་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་འདོད་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བར་སྦྱར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་ཐར་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་གནོད་པ་མེད་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་དྲང་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་དད་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་གདུལ་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་ཕྱིར་རྩོམ་སྟེ།
en: O sons of the victors, these bodhisattvas who have perfected application will perform whatever virtuous deeds they may undertake (1) for the sake of protecting all sentient beings, (2) with the desire to benefit all sentient beings, (3) with the resolve to make all sentient beings happy, (4) with kindness toward all sentient beings, (5) in order to liberate all sentient beings, (6) in order that all sentient beings avoid harm, (7) in order to guide all sentient beings, (8) in order that all sentient beings have faith, (9) in order to train all sentient beings, and (10) in order to cause all sentient beings to enter perfect nirvāṇa.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་སེམས་དཔའོ།
en: O sons of the victors, such are bodhisattvas who have perfected application.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་གནས་བཅུ་ཡང་དག་པར་བརྗོད་པར་བྱ་སྟེ།
en: “O sons of the victors, to those bodhisattvas who have perfected application ten topics ought to be expounded.

source: འདི་ལྟ་སྟེ། སེམས་ཅན་མཐའ་ཡས་པ་དང་། སེམས་ཅན་དཔག་ཏུ་མེད་པ་དང་། སེམས་ཅན་གྲངས་མེད་པ་དང་། སེམས་ཅན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སེམས་ཅན་མཚུངས་པ་མེད་པ་དང་། སེམས་ཅན་གཞལ་དུ་མེད་པ་དང་། སེམས་ཅན་སྟོང་པ་ཉིད་དང་། སེམས་ཅན་གཡོ་བ་མེད་པ་ཉིད་དང་། སེམས་ཅན་མེད་པ་ཉིད་དང་། སེམས་ཅན་རང་བཞིན་མེད་པ་ཉིད་དོ།
en: They are (1) that sentient beings are boundless, (2) that sentient beings are inestimable, (3) that sentient beings are innumerable, (4) that sentient beings are inconceivable, (5) that sentient beings are incomparable, (6) that sentient beings are immeasurable, (7) that sentient beings are empty, (8) that sentient beings are immovable, (9) that sentient beings are nonexistent, and (10) that sentient beings have no intrinsic nature.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: འདི་ལྟར་དེ་ཤས་ཆེར་མངོན་པར་ཞེན་པ་མེད་པ་ལ་སེམས་འཇོག་ཅིང་གོང་དུ་གནས་གང་དག་ཐོས་པའི་གནས་དེ་དག་ལ་ཡང་བདག་ཉིད་སྦྱོར་གྱི་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པ་ཐོབ་པའི་ཕྱིར་ཏེ།
en: It is because for the most part they settle their minds in non-attachment, and those subjects of learning acquired previously are mastered with their own application and without recourse to dependence on others.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པའོ།
en: O sons of the victors, such is the category of bodhisattvas who have perfected application. (6)

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་ལ་བསམ་པ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པ་གང་ཞེ་ན།
en: “O sons of the victors, what is the category of bodhisattvas who have perfected intention?

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ལ་བསམ་པ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་བཅུ་ཐོས་ན་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་བསམ་པ་ངེས་པ་ཡིན་ཏེ།
en: O sons of the victors, these bodhisattvas who have perfected intention, if they learn ten factors, will be decisively intent on the qualities of a Buddha.

source: འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་བསྔགས་པའམ། བསྔགས་པ་མ་ཡིན་པ་འཆད་ཀྱང་རུང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་བསམ་པ་ངེས་པ་ཡིན། ཆོས་ཀྱི་བསྔགས་པའམ། བསྔགས་པ་མ་ཡིན་པ་འཆད་ཀྱང་རུང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསྔགས་པའམ། བསྔགས་པ་མ་ཡིན་པ་འཆད་ཀྱང་རུང་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་བསམ་པ་ངེས་པ་ཡིན། བྱང་ཆུབ་སེམས་དཔའི་སྦྱོད་པའི་བསྔགས་པའམ། བསྔགས་པ་མ་ཡིན་པ་འཆད་ཀྱང་རུང་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་བསམ་པ་ངེས་པ་ཡིན། སེམས་ཅན་གྱི་ཁམས་རྒྱ་ཆུང་ཞེས་འཆད་པའམ། སེམས་ཅན་གྱི་ཁམས་རྒྱ་ཆེ་ཞེའམ། སེམས་ཅན་གྱི་ཁམས་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་ཞེའམ། སེམས་ཅན་གྱི་ཁམས་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་མ་ཡིན་ཞེའམ། སེམས་ཅན་གྱི་ཁམས་གདུལ་སླ་ཞེའམ། སེམས་ཅན་གྱི་ཁམས་གདུལ་དཀའ་ཞེའམ། ཆོས་ཀྱི་དབྱིངས་རྒྱ་ཆུང་ཞེའམ། ཆོས་ཀྱི་དབྱིངས་རྒྱ་ཆེ་ཞེའམ། འཇིག་རྟེན་གྱི་ཁམས་དག་འཇིག་ཅེའམ་མི་འཇིག་ཅེའམ་ཆོས་ཀྱི་དབྱིངས་ཡོད་ཅེའམ་ཆོས་ཀྱི་དབྱིངས་མེད་ཅེས་འཆད་ཀྱང་རུང་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་བསམ་པ་ངེས་པ་ཡིན་ཏེ།
en: They are: (1) their resolve will be set on the qualities of a buddha regardless of whether someone teaches in praise of or not in praise of a buddha, (2) their resolve will be set on the qualities of a buddha regardless of whether someone teaches in praise of or not in praise of the Dharma, (3) their resolve will be set on the qualities of a buddha regardless of whether someone teaches in praise of or not in praise of bodhisattvas, (4) their resolve will be set on the qualities of a buddha regardless of whether someone teaches in praise of or not in praise of the conduct of bodhisattvas, (5) their resolve will be set on the qualities of a buddha regardless of whether someone teaches that the realm of sentient beings is small or vast in scope, (6) their resolve will be set on the qualities of a buddha regardless of whether someone teaches that the realm of sentient beings is defiled or not, (7) their resolve will be set on the qualities of a buddha regardless of whether someone teaches that the realm of sentient beings is easy or difficult to train, (8) their resolve will be set on the qualities of a buddha regardless of whether someone teaches that the dharmadhātu is small or vast in scope, (9) their resolve will be set on the qualities of a buddha regardless of whether someone teaches that the world realms perish or do not perish, and (10) their resolve will be set on the qualities of a buddha regardless of whether someone teaches that the dharmadhātu exists or does not exist.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་བསམ་པ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་སེམས་དཔའོ།
en: O sons of the victors, such are bodhisattvas who have perfected intention.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་བསམ་པ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ཆོས་ཀྱི་རྗེས་སུ་འཇུག་པ་བཅུ་ཡང་དག་པར་བརྗོད་པར་བྱ་སྟེ།
en: “O sons of the victors, bodhisattvas who have perfected intention will be taught ten things that conform with phenomena.

source: ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་ཉིད་དུ་ཡང་དག་པར་བརྗོད་པར་བྱ་བ་དང་། ཆོས་ཐམས་ཅད་མཚན་ཉིད་མེད་པ་ཉིད་དང་། དངོས་པོ་མེད་པ་ཉིད་དང་། མེད་པ་ཉིད་དང་། བརྫུན་པ་ཉིད་དང་། དབེན་པ་ཉིད་དང་། ངོ་བོ་ཉིད་མེད་པ་ཉིད་དང་། སྒྱུ་མ་ལྟ་བུ་ཉིད་དང་། རྨི་ལམ་ལྟ་བུ་ཉིད་དང་། རྣམ་པར་རྟོག་པ་མེད་པ་ཉིད་དུ་ཡང་དག་པར་བརྗོད་པར་བྱའོ།
en: They should be taught that all phenomena: (1) are the very absence of phenomenal marks, (2) are without defining marks, (3) are not entities, (4) are nonexistent, (5) are deceptive, (6) are disengaged, (7) are essenceless, (8) are like illusions, (9) are like dreams, and (10) are without conceptual thought.

source: འདི་ལྟར་དེ་མི་འཕྲོགས་པའི་ཕྱིར་ཤས་ཆེར་ལྷག་པའི་བསམ་པ་རྣམ་པར་འཕེལ་བའི་ཆོས་ཅན་དུ་གྱུར་ཅིང་། གོང་དུ་གནས་གང་དག་ཐོས་པའི་གནས་དེ་དག་ལ་ཡང་བདག་ཉིད་སྦྱོར་གྱི་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པ་ཐོབ་པའི་ཕྱིར་ཏེ།
en: It is because since they are thus inalienable they possess for the most part the quality of increasing their excellent intention, and those subjects of learning acquired previously are mastered with their own application and without recourse to dependence on others.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་བསམ་པ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པའོ།།
en: O sons of the victors, such is the category of bodhisattvas who have perfected intention.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་ལ་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པ་གང་ཞེ་ན།
en: (7) “O sons of the victors, what is the category of bodhisattvas who are irreversible?

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ལ་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དམིགས་པ་བཅུ་ཐོས་ན། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལས་ཕྱིར་མི་ལྡོག་སྟེ།
en: O sons of the victors, bodhisattvas who are irreversible will not turn back from their progress toward the qualities of a buddha if they learn ten objectives.

source: སངས་རྒྱས་ཡོད་དོ་ཞེའམ་མེད་དོ་ཞེས་ཐོས་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལས་ཕྱིར་མི་ལྡོག་པ་དང་། ཆོས་ཡོད་དོ་ཞེའམ་མེད་དོ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡོད་དོ་ཞེ་འམ་མེད་དོ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོད་དོ་ཞེའམ་མེད་དོ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ངེས་པར་འབྱུང་ངོ་ཞེའམ་ངེས་པར་མི་འབྱུང་ངོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་དག་འདས་སོ་ཞེའམ་མ་འདས་སོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་དག་བྱོན་ཏོ་ཞེའམ་བྱོན་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་དག་ད་ལྟར་བྱུང་བའོ་ཞེའམ། ད་ལྟར་བྱུང་བ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཟད་དོ་ཞེའམ། མི་ཟད་དོ་ཞེས་བྱ་བ་དང་། དུས་གསུམ་པོ་དག་མཚན་ཉིད་གཅིག་ཅེའམ། མཚན་ཉིད་གཅིག་པ་མ་ཡིན་ནོ་ཞེས་ཐོས་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལས་ཕྱིར་མི་ལྡོག་པ་སྟེ།
en: (1) to progress irreversibly toward qualities of a buddha whether one hears that a buddha exists or does not exist, (2) to progress irreversibly whether one hears that the Dharma exists or does not exist, (3) to progress irreversibly whether one hears that bodhisattvas exist or do not exist, (4) to progress irreversibly whether one hears that the conduct of bodhisattvas exists or does not exist, (5) to progress irreversibly whether one hears that in bodhisattva conduct a bodhisattva leaves everything behind or does not leave everything behind, (6) to progress irreversibly whether one hears that the tathāgatas have passed away or have not passed away, (7) to progress irreversibly whether one hears that the tathāgatas have come into the world or not, (8) to progress irreversibly whether one hears that the tathāgatas have presently appeared or not, (9) to progress irreversibly whether one hears that the gnosis of the Buddha is exhausted or is not exhausted, and (10) to progress irreversibly whether one hears that the three times have the same defining mark or that they have dissimilar defining marks.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའོ།
en: O sons of the victors, such are bodhisattvas who are irreversible.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ཆོས་ཀྱི་རྒྱུན་བཅུ་ཡང་དག་པར་བརྗོད་པར་བྱ་སྟེ།
en: “O sons of the victors, to those bodhisattvas who are irreversible, ten continuities of phenomena should be explained.

source: ཆོས་ཐམས་ཅད་གཅིག་པ་ཉིད་དང་། ཐ་དད་པ་ཉིད་དུ་ཡང་དག་པར་བརྗོད་པར་བྱའོ། །མང་བ་དང་གཅིག་པ་ཉིད་དང་། ཡི་གེ་ལ་དོན་སྒྲོ་བཏགས་པ་དང་། དོན་ལ་ཡི་གེ་སྒྲོ་བཏགས་པ་དང་། དངོས་པོས་དངོས་པོ་མེད་པ་སྒྲོ་བཏགས་པ་དང་། དངོས་པོ་མེད་པས་དངོས་པོ་སྒྲོ་བཏགས་པ་དང་། མཚན་མས་མཚན་མ་མེད་པ་སྒྲོ་བཏགས་པ་དང་། མཚན་མ་མེད་པས་མཚན་མ་སྒྲོ་བཏགས་པ་དང་། མཚན་ཉིད་ཀྱིས་མཚན་ཉིད་མེད་པ་སྒྲོ་བཏགས་པ་དང་། མཚན་ཉིད་མེད་པས་མཚན་ཉིད་སྒྲོ་བཏགས་པ་ཡང་དག་པར་བརྗོད་པར་བྱའོ།
en: (1) explaining all phenomena as the same and different in nature, (2) as multiple and single in nature, (3) as meanings attributed to words, (4) as words attributed to meanings, (5) as the absence of entities attributed through entities, (6) as entities attributed through the absence of entities, (7) as the absence of phenomenal marks attributed through phenomenal marks, (8) as phenomenal marks attributed through the absence of phenomenal marks, (9) as the absence of defining marks attributed through defining marks, and (10) as defining marks attributed through the absence of defining marks.

source: འདི་ལྟར་དེ་ཤས་ཆེར་ཆོས་ཐམས་ཅད་ལ་མཁས་པ་ཡོངས་སུ་སྨིན་པའི་ཚུལ་ལ་ངེས་པར་འབྱུང་ཞིང་གོང་དུ་གནས་གང་དག་ཐོས་པའི་གནས་དེ་དག་ལ་ཡང་བདག་ཉིད་སྦྱོར་གྱི་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པ་ཐོབ་པའི་ཕྱིར་ཏེ།
en: It is because they have, for the most part, left everything behind as do those who have brought their expertise in all phenomena to fruition, and those subjects of learning acquired previously are mastered with their own application and without recourse to dependence on others.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པའོ།
en: O sons of the victors, such is the category of bodhisattvas who are irreversible. (8)

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་ལ་གཞོན་ནུར་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པ་གང་ཞེ་ན།
en: “O sons of the victors, what is the category of bodhisattvas who are still youths?

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ལ་གཞོན་ནུར་གྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་རྟོགས་པ་བཅུ་དང་ལྡན་པ་ཡིན་ཏེ།
en: O sons of the victors, bodhisattvas who are still youths possess ten understandings of the Dharma.

source: ལུས་ཀྱི་ལས་འབྲས་བུ་ཡོད་པ་དང་ལྡན་པ་ཡིན། ངག་གི་ལས་འབྲས་བུ་ཡོད་པ་དང་ལྡན་པ་ཡིན། ཡིད་ཀྱི་ལས་འབྲས་བུ་ཡོད་པ་དང་ལྡན་པ་ཡིན། སེམས་བསྐྱེད་པ་ཙམ་གྱིས་སྐྱེ་བ་མངོན་པར་སྒྲུབ་པ་ཡིན། སེམས་ཅན་གཞན་དག་དང་། གང་ཟག་གཞན་རྣམས་ཀྱི་བསམ་བ་ཤེས་པར་བྱེད་ཅིང་མོས་པ་ལ་རྟོག་པ་ཡིན། སེམས་ཅན་གྱི་ཁམས་ཐ་དད་པ་རབ་ཏུ་ཤེས་པ་ཡིན། འདོད་པའི་ཁམས་ཐ་དད་པ་རབ་ཏུ་ཤེས་པ་ཡིན། གཟུགས་ཀྱི་ཁམས་ཐ་དད་པ་རབ་ཏུ་ཤེས་པ་ཡིན། གཟུགས་མེད་པའི་ཁམས་ཐ་དད་པ་རབ་ཏུ་ཤེས་པ་ཡིན། དུས་ཇི་ལྟ་བ་བཞིན་དུ་འགྲོ་བའི་ཕྱིར་མངོན་པར་ཤེས་པ་མྱུར་བ་ཡིན་ཏེ།
en: (1) knowing bodily deeds together with their karmic results, (2) knowing verbal deeds together with their karmic results, (3) knowing mental deeds together with their karmic results, (4) knowing how to obtain a new birth merely by generating the thought of doing so, (5) knowing the thoughts of other sentient beings and people and understanding their inclinations, (6) knowing the different realms of sentient beings, (7) knowing the different desire realms, (8) knowing the different form realms, (9) knowing the different formless realms, and (10) swiftly gaining clairvoyance for the sake of beings present in different time periods.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་གཞོན་ནུར་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའོ།
en: O sons of the victors, such is the category of bodhisattvas who are still youths.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་གཞོན་ནུར་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ཆོས་མངོན་པར་སྒྲུབ་པ་བཅུ་ཡང་དག་པར་བརྗོད་པར་བྱ་སྟེ།
en: “O sons of the victors, to bodhisattvas who are still youths should be taught ten ways of perfecting the Dharma.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་ཤེས་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་རབ་ཏུ་གཡོ་བར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བྱིན་གྱིས་བརླབ་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དཔྱད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པར་འགྲོ་བ་དང་། དྲི་བ་གྲངས་མེད་པ་དྲི་བ་དང་། ཡིད་ཀྱི་ལུས་མངོན་པར་སྒྲུབ་པ་དང་། སྒྲ་སྐད་ལ་སྦྱོར་བ་ཚད་མེད་པ་དང་། སེམས་བསྐྱེད་པས་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པ་ཡོངས་སུ་འགྲུབ་པ་ཡང་དག་པར་བརྗོད་པར་བྱའོ།།
en: They are being correctly shown how to (1) comprehend buddhafields, (2) shake buddhafields, (3) bless buddhafields, (4) investigate buddhafields, (5) journey to buddhafields, (6) journey to countless world realms, (7) ask countless questions, (8) fully achieve a mental body, (9) have measureless translations of words and languages, and (10) accomplish countless buddhafields by generating the thought of doing so.

source: འདི་ལྟར་དེ་ཤས་ཆེར་མངོན་པར་སྒྲུབ་པ་མཁས་པ་ལ་སྦྱོར་ཞིང་། གོང་དུ་གནས་གང་དག་ཐོས་པའི་གནས་དེ་དག་ལ་ཡང་བདག་ཉིད་སྦྱོར་གྱི་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པ་ཐོབ་པའི་ཕྱིར་ཏེ།
en: It is because for the most part they apply themselves to expertise in perfecting things, and those subjects of learning acquired previously are mastered with their own application and without recourse to dependence on others.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་གཞོན་ནུར་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པའོ།
en: O sons of the victors, such is the category of bodhisattvas who are still youths. (9)

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་ལ་རྒྱལ་ཚབ་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པ་གང་ཞེ་ན།
en: “O sons of the victors, what is the category of bodhisattvas who are regents?

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ལ་རྒྱལ་ཚབ་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་རྟོགས་པར་བྱ་བ་བཅུ་ལ་མཁས་པ་ཡིན་ཏེ།
en: O sons of the victors, bodhisattvas who are regents are expert in ten factors to be understood.

source: སེམས་ཅན་གྱི་སྐྱེ་བ་རྟོགས་པར་བྱ་བ་ལ་མཁས་པ་ཡིན། ཉོན་མོངས་པ་རྒྱུ་བ་རྟོགས་པར་བྱ་བ་ལ་མཁས་པ་ཡིན། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་རྟོགས་པར་བྱ་བ་ལ་མཁས་པ་ཡིན། སྤྱོད་ཡུལ་ལ་སྦྱོར་བ་རྟོགས་པར་བྱ་བ་ལ་མཁས་པ་ཡིན། ཆོས་ཉིད་རྟོགས་པར་བྱ་བ་ལ་མཁས་པ་ཡིན། ཉེ་བར་སྤྱད་པ་རྟོགས་པར་བྱ་བ་ལ་མཁས་པ་ཡིན། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་དབྱེ་བ་རྟོགས་པར་བྱ་བ་ལ་མཁས་པ་ཡིན། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་དང་། ད་ལྟར་བྱུང་བ་ཤེས་པ་རྟོགས་པར་བྱ་བ་ལ་མཁས་པ་ཡིན། ཀུན་རྫོབ་ཀྱི་བདེན་པ་ལ་ངེས་པར་རྟོགས་པ་རྟོགས་པར་བྱ་བ་ལ་མཁས་པ་ཡིན་ཏེ། ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་རྒྱལ་ཚབ་ཀྱི་བྱང་ཆུབ་སེམས་དཔའོ།
en: (1) expertise in understanding the births of sentient beings, (2) expertise in understanding the flux of the defilements, (3) expertise in understanding the connections of latent tendencies, (4) expertise in understanding the engagement in the object domains, (5) expertise in understanding ultimate reality, (6) expertise in understanding experiences, (7) expertise in understanding the sphere of the world, (8) expertise in understanding the past and the future, (9) expertise in understanding the present, and (10) expertise in understanding the investigation of the relative truth. O sons of the victors, such are bodhisattvas who are regents.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་རྒྱལ་ཚབ་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་གནས་བཅུ་ཡང་དག་པར་བརྗོད་པར་བྱ་སྟེ།
en: “O sons of the victors, to these bodhisattvas who are regents should be taught ten things.
